## Com afegir columnes al Dataframe

In [7]:
import pandas as pd

personas = {
    "nombre": ["Pere", "Joan", "Núria"],
    "edad": [30, 33, 28],
    "dni": ["45623817T", "67845239S", "78465923P"]
}

df = pd.DataFrame(personas)
df

#Sintàxis bàsica
df["profesiones"] = ["matemático", "bombero", "doctora"]
df

#Mètode assign
df = df.assign(sueldo = [45e3, 25e3, 40e3])
df

#Mètode insert
df.insert(3, "email", ["pere@mail.com", "joan@bombers.cat", "nuriabc@catsalut.cat"])
df

  nombre  edad        dni                 email profesiones   sueldo
0   Pere    30  45623817T         pere@mail.com  matemático  45000.0
1   Joan    33  67845239S      joan@bombers.cat     bombero  25000.0
2  Núria    28  78465923P  nuriabc@catsalut.cat     doctora  40000.0

### Com obtenir files d'un DataFrame

In [15]:
#Sintàxis bàsica
condicio = df["nombre"] == "Joan"
print(condicio)
df [condicio ]

0    False
1     True
2    False
Name: nombre, dtype: bool

  nombre  edad        dni             email profesiones   sueldo
1   Joan    33  67845239S  joan@bombers.cat     bombero  25000.0

In [21]:
#Mètode isin
condicio = df.email.isin(["pere@mail.com", "joana@bombers.cat"]) | df.nombre.isin(["Núria"])
df[condicio]

  nombre  edad        dni                 email profesiones   sueldo
0   Pere    30  45623817T         pere@mail.com  matemático  45000.0
2  Núria    28  78465923P  nuriabc@catsalut.cat     doctora  40000.0

In [37]:
#Mètode iloc
df.iloc[[0, 1], [2,3]] 
#si enlloc de posar [2,3] posem : ens mostrarà totes les dades de les columnes

         dni             email
0  45623817T     pere@mail.com
1  67845239S  joan@bombers.cat

In [51]:
#Mètode set_index and loc
nombres = df.set_index("nombre")
#print(nombres)
nombres.loc[["Pere", "Núria"], ["dni", "email"]]

              dni                 email
nombre
Pere    45623817T         pere@mail.com
Núria   78465923P  nuriabc@catsalut.cat